/*
描述
在一个整数数组上，对于下标为i的整数，如果它大于所有它相邻的整数，或者小于所有它相邻的整数，则称为该整数为一个极值点，极值点的下标就是i。
输入
有2×n+1行输入：第一行是要处理的数组的个数n；对其余2×n行，第一行是此数组的元素个数k(4<k<80)，第二行是k个整数，每两个整数之间用空格分隔。
输出
输出为n行：每行对应于相应数组的所有极值点下标值，下标值之间用空格分隔。
样例输入
3
10
10 12 12 11 11 12 23 24 12 12
15
12 12 122 112 222 211 222 221 76 36 31 234 256 76 76 
15
12 14 122 112 222 222 222 221 76 36 31 234 256 76 73 
样例输出
0 7
2 3 4 5 6 10 12
0 2 3 10 12 14
*/


#include <iostream>
using namespace std;

int main()
{
	int ncase;
	int n, i;
	int arr[10000];
	cin >> ncase;
	while(ncase--)
	{
		cin >> n;
		for(i = 0;i < n;i++)
			cin >> arr[i];

		if (n == 1 || arr[0] != arr[1])
			cout << 0 << " ";

		for(i = 1;i < n - 1;i++)
			if (arr[i] > arr[i - 1] && arr[i] > arr[i + 1] || arr[i] < arr[i + 1] && arr[i] < arr[i - 1])
				cout << i << " ";

		if (n != 1 && arr[n - 1] != arr[n - 2])
			cout << n - 1;
		cout << endl;
	}
	return 0;
}
