/*
描述
小朋友玩跳绳比赛,要计算在一分钟内跳了多少下.假设每秒钟跳一下,如果中途失败了,则要花三秒钟后才能开始重跳.一般小朋友跳绳一分钟要跳坏好几次.现在给出小朋友每次跳坏时已经跳的总数,求小朋友在一分钟内跳了多少下.(请注意分析示例数据.)
输入
第一行为n个小朋友
其余各行,每行第一个整数是跳坏的次数m,其余m个整数是跳坏时累计跳了多少下.
输出
输出相应小朋友头一分钟内跳了多少下.
样例输入
6
0
3 12 23 45 
1 17
4 10 20 30 40
5 10 20 30 40 58 
6 10 20 30 40 47 60
样例输出
60
51
57
48
48
47
提示
提示,在跳绳比赛时,你可能已经超时了,但自己还在计数,但裁判已经停止计时并得到成绩了.这里相当与自己计数.因此,并非跳坏的时候都是在前一分钟以内.请注意分析示例数据.
*/


#include <iostream>
using namespace std;

int main()
{
	int m;
	int i, n;
	int arr[1000];
	cin >> m;

	while(m--)
	{
		cin >> n;
		for(i = 0;i < n;i++)
			cin >> arr[i];

		int res = 0;
		int sec = 0;

		for(i = 0;i < n;i++)
		{
			sec = i * 3 + arr[i];
			if (sec >= 60)
			{
				res = arr[i] - (sec - 60);
				sec = 60;
				break;
			}
			if (sec + 3 >= 60)
			{
				res = arr[i];
				sec = 60;
				break;
			}
		}
	//	cout << sec << endl;
		if (n * 3 + arr[n - 1] < 60)
			res = arr[n - 1] + (60 - n * 3 - arr[n - 1]);
		cout << res << endl;
	}
	return 0;
}
